WildernessLabs/Meadow/configs/stm32f777zit6-meadow/src/meadow-upd-interrupt.c
  if(gpioMapTblPtr->CurrentProcessState != updipstate_mon_no_delay)
  {
    syslog(LOG_ERR, "%s@%d-PinId:0x%02x No delay interrupt but not updipstate_mon_no_delay\n",
            __FILE__, __LINE__, gpioMapTblPtr->PinId);
    return OK;
  }

  // Configured for neither glitch or debounce delay, so send ASAP.
  uint8_t currentState = upd_read_current_gpio_state(gpioMapTblPtr);
  upd_forward_interrupt_to_core(gpioMapTblPtr, currentState);

  return OK;
}

//===========================================================================
// There has been a transition on a GPIO pin that we've been ask to delay
static int upd_gpio_interrupt(int irq, void *context, void *arg)
{  
#if MEADOW_UPD_INCLUDE_DIAGNOSTIC_SYSLOG > 0
  syslog(LOG_INFO, "upd-(GPIO isr)-received interrupt. numbGpioBeingTimed:%d\n", numbGpioBeingTimed);
#endif

  // Is there any work to do?
  if(numbGpioBeingTimed < 1)
    return OK;

  struct interruptPinMap_s *gpioMapTblPtr = (struct interruptPinMap_s *)arg;

  // Properly setup?
  if(gpioMapTblPtr == NULL)
  {
    syslog(LOG_ERR, "%s@%d-PinId:0x%02x <unconfigured> gpioMapTblPtr == NULL\n",
            __FILE__, __LINE__, gpioMapTblPtr->PinId);
    return OK;
  }

#if MEADOW_UPD_INCLUDE_DIAGNOSTIC_SYSLOG > 0
    syslog(LOG_INFO, "upd-(GPIO isr)-0x%02x (P%c%d)- received interrupt\n",
            gpioMapTblPtr->PinId,
            ((gpioMapTblPtr->PinId) >> 4) + 'A', gpioMapTblPtr->PinId & 0x0f);
#endif

  // Unless waiting for gpio interrupt, ignore
  if(gpioMapTblPtr->CurrentProcessState != updipstate_wait_gpio_isr)
  {
    // The updipstate_uncfg, updipstate_mon_glitch and updipstate_mon_debounce states
    // exit here. When work is finished the state is returned to updipstate_wait_gpio_isr.
    // Therefore, switch bouncing will exits here too, assuming the delay is long enough
#if MEADOW_UPD_INCLUDE_DIAGNOSTIC_SYSLOG > 0
    syslog(LOG_INFO, "upd-(GPIO isr)--PinId:0x%02x ignored\n", gpioMapTblPtr->PinId);
#endif
    return OK;
  }

  // This GPIO is not being processed so begin processing
  upd_add_gpio_to_timed_list(gpioMapTblPtr);

  // Check configuration to know what to do, glitch, debounce or just pass
  // through.
  // Note: Minimal processing is done here, just setup for the
  // timer to do the the real work.   
  if(gpioMapTblPtr->GlitchRequestedDuration > 0)
  {
#if MEADOW_UPD_INCLUDE_DIAGNOSTIC_SYSLOG > 0
    syslog(LOG_INFO, "upd-(GPIO isr)--PinId:0x%02x, Process glitch\n", gpioMapTblPtr->PinId);
#endif
    // Glitch always runs before Debounce if Debounce configured
    gpioMapTblPtr->GlitchTimeoutsCounter = 0;
    gpioMapTblPtr->CurrentProcessState = updipstate_mon_glitch;
    totalGpiosBeingTimed++;
    STM32_TIM_SETMODE(_periodicTimer, STM32_TIM_MODE_UP);
  }
  else if(gpioMapTblPtr->DebounceRequestedDuration > 0)
  {
#if MEADOW_UPD_INCLUDE_DIAGNOSTIC_SYSLOG > 0
    syslog(LOG_INFO, "upd-(GPIO isr)--PinId:0x%02x, Process debounce\n", gpioMapTblPtr->PinId);
#endif

    gpioMapTblPtr->DebounceDownCounter = gpioMapTblPtr->DebounceRequestedDuration;
    gpioMapTblPtr->CurrentProcessState = updipstate_mon_debounce;
    totalGpiosBeingTimed++;
    STM32_TIM_SETMODE(_periodicTimer, STM32_TIM_MODE_UP);
  }
  else
  {
    // Both Glitch and Debounce durations have reached zero and the interrupt mode
    // is set, so read the state and send it.
    uint8_t currentState = upd_read_current_gpio_state(gpioMapTblPtr);
    if(currentState == gpioMapTblPtr->LastKnownGpioState)
      return OK;

#if MEADOW_UPD_INCLUDE_DIAGNOSTIC_SYSLOG > 0
    syslog(LOG_INFO, "upd-(GPIO isr)--PinId:0x%02x, Glitch and Debounce reached zero. Notify as:0x%02x (was:0x%02x)\n",
        gpioMapTblPtr->PinId, newState, gpioMapTblPtr->LastKnownGpioState);
#endif
    if(upd_forward_interrupt_to_core(gpioMapTblPtr, currentState) == OK)
      gpioMapTblPtr->LastKnownGpioState = currentState;
  }

  return OK;
}

//===============================================================
// This function is called every 100 microseconds when the timer
// is running
int upd_periodic_timeout_isr(int irq, void *context, void *arg)
{
  int result;
  struct interruptPinMap_s *gpioMapTblPtr;

  // Acknowledge timer interrupt. Fortunately at this point we don't
  // care about which GPIO this is for.
  STM32_TIM_ACKINT(_periodicTimer, GTIM_SR_UIF);

  // Timer only needed if at least one gpio configured and active
  if(numbGpioBeingTimed == 0 || totalGpiosBeingTimed == 0)
  {
    return OK;
  }

  // Check all active GPIOs
  int offset = 0;
  while(gpiosBeingTimed[offset] != NULL)
  {
    gpioMapTblPtr = gpiosBeingTimed[offset++];
    
    // DEBUGASSERT(gpioMapTblPtr->CurrentProcessState == updipstate_mon_glitch ||
    //     gpioMapTblPtr->CurrentProcessState == updipstate_mon_debounce);
    // DEBUGASSERT(gpioMapTblPtr->CurrentProcessState != updipstate_wait_gpio_isr);

    // Monitoring Debounce or Glitch?
    if(gpioMapTblPtr->CurrentProcessState == updipstate_mon_debounce)
    {
      //----- Debounce Filtering -----
      result = upd_process_gpio_debounce(gpioMapTblPtr);
      if(result == gadrv_keepwaiting)
        continue;

      if(result == gadrv_break)
        break;
    }

    if(gpioMapTblPtr->CurrentProcessState == updipstate_mon_glitch)
    {
      //----- Glitch Filtering -----
      result = upd_process_gpio_glitch(gpioMapTblPtr);
      if(result == gadrv_keepwaiting)
        continue;

      // We reached the end of the glitch filtering
      // Should we switch to debounce?
      if(gpioMapTblPtr->DebounceRequestedDuration > 0 && result == gadrv_validtransitiondetected)
      {
        // Debounce is also configured for > 0 duration and this interrupt is not a "glitch"
        gpioMapTblPtr->DebounceDownCounter = gpioMapTblPtr->DebounceRequestedDuration;
        gpioMapTblPtr->CurrentProcessState = updipstate_mon_debounce;
        continue;
      }
      else
      {
        // Terminate glitch capture for this GPIO since nothing else to do
        upd_remove_gpio_to_timed_list(gpioMapTblPtr);
        totalGpiosBeingTimed--;
        gpioMapTblPtr->CurrentProcessState = updipstate_wait_gpio_isr;
        if(totalGpiosBeingTimed == 0)
          break;    // Cannot be more work to do, so quit loop
      }
    }
  }

