WildernessLabs/Meadow/configs/stm32f777zit6-meadow/src/meadow-upd-interrupt.c
  // Stop Timer if no GPIO needs it
  if(totalGpiosBeingTimed == 0)
  {
    int ret = STM32_TIM_SETMODE(_periodicTimer, STM32_TIM_MODE_DISABLED);
    if(ret < 0)
    {
      syslog(LOG_ERR, "%s@%d-0x%02x udp-(time isr)--STM32_TIM_SETMODE failed:%d\n",
                __FILE__, __LINE__, gpioMapTblPtr->PinId, ret);
    }
  }

  return OK;
}

//========================================================================
// Process debounce
int upd_process_gpio_debounce(struct interruptPinMap_s *gpioMapTblPtr)
{
  if(gpioMapTblPtr->DebounceDownCounter == gpioMapTblPtr->DebounceRequestedDuration)
  {
    // This is the first time to process this debounce filter request

#if MEADOW_UPD_INCLUDE_DIAGNOSTIC_SYSLOG > 0
    syslog(LOG_INFO, "upd-(deb)-0x%02x DEBOUNCE Starting\n", gpioMapTblPtr->PinId);
    gpioMapTblPtr->TimeProcessingBegan = clock_systimer();
#endif

    // In the case both Glitch and Debounce are requested, Gliitch has
    // already sent the interrupt, if it's going to. Only if Glitch does
    // send an interrupt and debounce duration is > 0, will Debounce keep
    // new interrupts inactive until debounce duration has elasped.
    if(gpioMapTblPtr->GlitchRequestedDuration == 0)
    {
      // Glitch filtering not configured but Debounce was, so send
      // interrupt now.
      upd_meadow_debounce_notification_logic(gpioMapTblPtr);
    }
#if MEADOW_UPD_INCLUDE_DIAGNOSTIC_SYSLOG > 0
    else
    {
      syslog(LOG_INFO, "upd-(deb)-0x%02x Debounce started following Glitch\n", gpioMapTblPtr->PinId);
    }
#endif
  }

  // This is the start of Debounce processing. Step one is to notify the Meadow.Foundation
  // by sending an interrupt, unless one already sent by glitch filtering.

  // For Debounce this is all that needs to be done, wait for time to pass.
  // Decrement the timeout count. When it reaches 0, re-enbled the gpio interrupts.
  gpioMapTblPtr->DebounceDownCounter--;
  if(gpioMapTblPtr->DebounceDownCounter > 0)
    return gadrv_keepwaiting;   // Not done yet

#if MEADOW_UPD_INCLUDE_DIAGNOSTIC_SYSLOG > 0
  uint32_t procTime = clock_systimer() - gpioMapTblPtr->TimeProcessingBegan;
  syslog(LOG_INFO, "upd-(deb)-0x%02x Debounce proccessing ended in %d ms\n",
            gpioMapTblPtr->PinId, procTime);
#endif

  // Finished with debounce timing. Since the GPIO state should now be
  // stable, save it for next time, especially for InterruptMode.Both
  gpioMapTblPtr->LastKnownGpioState = upd_read_current_gpio_state(gpioMapTblPtr);

  // Terminate this GPIO's capture. Postpone this process state transition as
  // late as possible
  upd_remove_gpio_to_timed_list(gpioMapTblPtr);
  totalGpiosBeingTimed--;
  gpioMapTblPtr->CurrentProcessState = updipstate_wait_gpio_isr;
  if(totalGpiosBeingTimed == 0)
    return gadrv_break;       // Cannot be more work to do, so quit loop too

  return gadrv_keepwaiting;   // Go to next gpio
}

//========================================================================
// Glitch filtering is done here.
int upd_process_gpio_glitch(struct interruptPinMap_s *gpioMapTblPtr)
{
  if(gpioMapTblPtr->GlitchTimeoutsCounter == 0)
  {
    // First time to process glitch
#if MEADOW_UPD_INCLUDE_DIAGNOSTIC_SYSLOG > 0
    syslog(LOG_INFO, "upd-(glitch)-0x%02x Glitch Starting\n", gpioMapTblPtr->PinId);
#endif
    gpioMapTblPtr->TimeProcessingBegan = clock_systimer();
  }

  gpioMapTblPtr->GlitchTimeoutsCounter++;

  // If GlitchRequestedDuration is greater than MEADOW_UPD_GLITCH_TIME_TO_SWITCH_TO_MS
  // we use time based, not count based to establish completion. This is because using
  // counts is more accurate for short delays (100 usec resolution). And long delays
  // accumulate an increasing error. Also, if GlitchRequestedDuration is greater than
  // MEADOW_UPD_GLITCH_TIME_TO_SWITCH_TO_MS we'll only read the GPIO state every
  // millisecond not every timer interrupt.
  if(gpioMapTblPtr->GlitchRequestedDuration > MEADOW_UPD_GLITCH_TIME_TO_SWITCH_TO_MS)
  {
    // Using sys time so check about every millisecond not every 100 microseconds.
    if(gpioMapTblPtr->GlitchTimeoutsCounter % MEADOW_UPD_TICK_MILLISEC_FACTOR != 0)
      return gadrv_keepwaiting;
  }

  uint8_t currentState = upd_read_current_gpio_state(gpioMapTblPtr);

  if(currentState != gpioMapTblPtr->GlitchPrevGpioState)
  {
    // GPIO state is different from last, save the new state and reset time
    gpioMapTblPtr->TimeProcessingBegan = clock_systimer();
    gpioMapTblPtr->GlitchTimeoutsCounter = 0;

#if MEADOW_UPD_INCLUDE_DIAGNOSTIC_SYSLOG > 0
    syslog(LOG_INFO, "upd-(glitch)-0x%02x Glitch state changed was:%d now:%d\n",
          gpioMapTblPtr->PinId, gpioMapTblPtr->GlitchPrevGpioState, currentState);
#endif
    gpioMapTblPtr->GlitchPrevGpioState = currentState;
    return gadrv_keepwaiting;
  }

  // GPIO State stable since last check?
  if(gpioMapTblPtr->GlitchRequestedDuration > MEADOW_UPD_GLITCH_TIME_TO_SWITCH_TO_MS)
  {
    // Check base on sys clock
    uint32_t elapedTimeMs = clock_systimer() - gpioMapTblPtr->TimeProcessingBegan;
    if(elapedTimeMs < gpioMapTblPtr->GlitchRequestedDuration/MEADOW_UPD_TICK_MILLISEC_FACTOR)
      return gadrv_keepwaiting;   // Not done yet
  }
  else
  {
    // Check based on 100 usec timer
    if(gpioMapTblPtr->GlitchTimeoutsCounter < gpioMapTblPtr->GlitchRequestedDuration)
      return gadrv_keepwaiting;   // Need to keep checking
  }

  // Finished checking
#if MEADOW_UPD_INCLUDE_DIAGNOSTIC_SYSLOG > 0
  uint32_t totalTime = clock_systimer() - gpioMapTblPtr->TimeProcessingBegan;
  syslog(LOG_INFO, "upd-(glitch)-0x%02x Glitch completed in %d ms, timeouts:%d\n",
          gpioMapTblPtr->PinId, totalTime, gpioMapTblPtr->GlitchTimeoutsCounter);
#endif

  // We've found a stable state.
  // Need to determine whether a interrupt notification is needed
  if(gpioMapTblPtr->LastKnownGpioState != currentState)
  {
    bool isRising = gpioMapTblPtr->LastKnownGpioState < currentState;
    switch(gpioMapTblPtr->GpioInterruptMode)
    {
      case rqstdintmode_both:
#if MEADOW_UPD_INCLUDE_DIAGNOSTIC_SYSLOG > 0
        syslog(LOG_INFO, "upd_(glitch)-0x%02x Notifying Meadow.Core, rqstdintmode_both\n", gpioMapTblPtr->PinId);
#endif
        upd_forward_interrupt_to_core(gpioMapTblPtr, currentState);
        break;

      case rqstdintmode_falling:
        if(!isRising)
        {
#if MEADOW_UPD_INCLUDE_DIAGNOSTIC_SYSLOG > 0
          syslog(LOG_INFO, "upd_(glitch)-0x%02x Notifying, Falling and config rqstdintmode_falling\n", gpioMapTblPtr->PinId);
#endif
          upd_forward_interrupt_to_core(gpioMapTblPtr, currentState);
        }
#if MEADOW_UPD_INCLUDE_DIAGNOSTIC_SYSLOG > 0
        else
        {
          syslog(LOG_INFO, "upd_(glitch)-0x%02x ignoring, Rising but config rqstdintmode_falling\n", gpioMapTblPtr->PinId);
        }
#endif
        break;

      case rqstdintmode_rising:
        if(isRising)
        {
#if MEADOW_UPD_INCLUDE_DIAGNOSTIC_SYSLOG > 0
          syslog(LOG_INFO, "upd_(glitch)-0x%02x Notifying, Rising and config rqstdintmode_rising\n", gpioMapTblPtr->PinId);
#endif
          upd_forward_interrupt_to_core(gpioMapTblPtr, currentState);
        }
#if MEADOW_UPD_INCLUDE_DIAGNOSTIC_SYSLOG > 0
        else
        {
          syslog(LOG_INFO, "upd_(glitch)-0x%02x Ignoring, Falling but config rqstdintmode_rising\n", gpioMapTblPtr->PinId);
        }
#endif
        break;

      case rqstdintmode_none:
      default:
        syslog(LOG_ERR, "%s@%d-0x%02x unexpected case:%d\n",
                  __FILE__, __LINE__, gpioMapTblPtr->PinId, gpioMapTblPtr->GpioInterruptMode);
        break;
    }
  }
#if MEADOW_UPD_INCLUDE_DIAGNOSTIC_SYSLOG > 0
  else
  {
    // gpioMapTblPtr->LastKnownGpioState == currentState i.e. no change. It's a glitch, ignore it
    syslog(LOG_INFO, "upd_(glitch)-0x%02x No GPIO state change-Ignore\n", gpioMapTblPtr->PinId);
  }
#endif

