WildernessLabs/Meadow/configs/stm32f777zit6-meadow/src/meadow-upd-interrupt.c
  // arg (third parameter) is a pointer that's returned in the isr handler
  ret = STM32_TIM_SETISR(tempTimer, isrHandler, NULL, 0);
  if(ret < 0)
  {
    syslog(LOG_ERR, "%s@%d-STM32_TIM_SETISR failed:%d\n",
          __FILE__, __LINE__, ret);
    return ret;
  }

  // Prevent interrupts until needed
  STM32_TIM_SETMODE(tempTimer, STM32_TIM_MODE_DISABLED);

  // Finish set up
  STM32_TIM_ACKINT(tempTimer, GTIM_SR_UIF);
  STM32_TIM_ENABLEINT(tempTimer, GTIM_DIER_UIE);

  _periodicTimer = tempTimer;
  return OK;
}

/****************************************************************************
 * Public Functions
 ****************************************************************************/
// Called from meadow-upd.c to configure a gpio for monitoring
int upd_config_interrupt(struct upd_gpio_int_config* cfg)
{
  struct interruptPinMap_s *gpioMapTblPtr;
  uint32_t designator = cfg->port << 4 | cfg->pin;
  uint32_t pinMapOffset;
  int ret;

  // Walk the gpio data array to find the desired entry
  for(pinMapOffset = 0; pinMapOffset < MEADOW_UPD_F7_SUPPORTED_GPIOS; pinMapOffset++)
  {
    if(gpioDebounceData[pinMapOffset].PinId == designator)
      break;
  }

  if(pinMapOffset == MEADOW_UPD_F7_SUPPORTED_GPIOS)
  {
    // GPIO not found in data table? This us not expected.
    syslog(LOG_ERR, "upd-(cfg)--No entry in table for 0x%02x\n", designator);
    return -1;
  }

  // Grab the correct entry's table address
  gpioMapTblPtr = &gpioDebounceData[pinMapOffset];

  if(_firstTimeConfig)
  {
    // Only do this once, the first time
    ret = upd_config_interrupt_prep_timer(MEADOW_UPD_INTERRUPT_STM32F7_TIMER_NUMBER);
    if(ret < 0)
    {
      syslog(LOG_ERR, "upd-(cfg)---upd_config_interrupt_prep_timer failed\n");
      return -1;
    }

    for(int i = 0; i < MEADOW_UPD_F7_SUPPORTED_GPIOS; i++)
    {
      gpiosBeingTimed[i] = NULL;
    }
    timedGpioPinCount = 0;

    _firstTimeConfig = false;
  }

  if(cfg->enable)
  {
    // Get the current GPIO state which can may be used to when processing
    // interrupts
    // uint32_t idrRegisterValues = *((uint32_t *)(gpioMapTblPtr->IDRAddress));
    // uint8_t pinNumb = gpioMapTblPtr->PinId & 0x0f;
    // gpioMapTblPtr->LastKnownGpioState = (idrRegisterValues & (1 << pinNumb)) > 0 ? 1 : 0;
    gpioMapTblPtr->LastKnownGpioState = upd_read_current_gpio_state(gpioMapTblPtr);
    gpioMapTblPtr->GlitchPrevGpioState = gpioMapTblPtr->LastKnownGpioState;

    // Note: the available configuration is 0.0 (none), 0.1 - 1000 millisec.
    // Foundation.Core will supply a value of 0, 1 - 10000. Since the timer 
    // is set at 100 usec then the count provided is the same as the number
    // of timer timeouts received.

    // Set both Debounce and Glitch delay times
    gpioMapTblPtr->DebounceRequestedDuration = cfg->debounceDuration;
    gpioMapTblPtr->GlitchRequestedDuration = cfg->glitchDuration;      
    gpioMapTblPtr->GlitchTimeoutsCounter = 0;

    // none = 0, rising = 1, falling = 2 & both = 3 (must match F7GPIOManager_interrupts.cs
    // in WireInterrupt()
    gpioMapTblPtr->GpioInterruptMode = (cfg->risingEdge & 0x01) | (cfg->fallingEdge & 0x01) << 1;

    // cfgset contains 20-bits of data. It is required by the Nuttx stm32_gpiosetevent
    // function. If the 20 bits of data are not correct, this Nuttx function will
    // reconfigure the GPIO based on whatever the data is cfgset.
    // See stm32_gpio.h for more information.
    // Inputs: MMUU .... ...X PPPP BBBB
    // MM = Mode for input (this is 00)
    // UU = pull up, pull down or float
    // X  = is external interrupt selection, stm32_gpiosetevent sets this
    uint32_t cfgset = (designator & 0x000000ff);   // Set Port and Pin and clear MM

    switch(cfg->resistorMode)
    {
      case 0: // Float
        cfgset |= GPIO_FLOAT;
        break;    // 0 = do nothing
      case 1: // Pull up
        cfgset |= GPIO_PULLUP;
        break;
      case 2: // Pull down
        cfgset |= GPIO_PULLDOWN;
        break;
    }

#if MEADOW_UPD_INCLUDE_DIAGNOSTIC_SYSLOG > 0
    syslog(LOG_INFO, "upd-(cfg)- 0x%02x (P%c%d)-Cfg Enabled-LKS:%d, GLDuration:%d, DBDuration:%d, InterruptMode:%d, cfgset:0x%08x\n",
              gpioMapTblPtr->PinId,
              ((gpioMapTblPtr->PinId) >> 4) + 'A', gpioMapTblPtr->PinId & 0x0f,
              gpioMapTblPtr->LastKnownGpioState,
              gpioMapTblPtr->GlitchRequestedDuration,
              gpioMapTblPtr->DebounceRequestedDuration,
              gpioMapTblPtr->GpioInterruptMode,
              cfgset);
#endif

    // Tell Nuttx about interrupt parameters
    if(gpioMapTblPtr->GlitchRequestedDuration > 0)
    {
      // For Glitch we must receive both rising and falling or we cannot keep
      // LastKnownGpioState accurate. After a stable state is reached we save
      // this value. Without this we couldn't send rising and falling correctly
      // to Meadow.Core
      ret = stm32_gpiosetevent(
      cfgset,               // special gpio for call
      1,                    // risingEdge,
      1,                    // fallingEdge,
      0,                    // event
      upd_gpio_interrupt,   // function to call
      gpioMapTblPtr);       // table entry pointer

      // If not already configured
      if(gpioMapTblPtr->CurrentProcessState == updipstate_uncfg)
          numbGpioBeingTimed++;
      gpioMapTblPtr->CurrentProcessState = updipstate_wait_gpio_isr;
    }
    else if(gpioMapTblPtr->DebounceRequestedDuration > 0)
    {
      // For Debounce we cannot know the GPIOs state for certain when we receive
      // the interrupt notification, so we rely on the MCU only sending interrupts
      // based on the rising and falling configuration. For Both (rising and falling)
      // we assume that the state is the opposite of the last know state.
      ret = stm32_gpiosetevent(
      cfgset,               // special gpio for call
      cfg->risingEdge,      // risingEdge,
      cfg->fallingEdge,     // fallingEdge,
      0,                    // event
      upd_gpio_interrupt,   // function to call
      gpioMapTblPtr);       // table entry pointer

      // If not already configured
      if(gpioMapTblPtr->CurrentProcessState == updipstate_uncfg)
          numbGpioBeingTimed++;
      gpioMapTblPtr->CurrentProcessState = updipstate_wait_gpio_isr;
    }
    else
    {
#if MEADOW_UPD_INCLUDE_DIAGNOSTIC_SYSLOG > 0
      syslog(LOG_INFO, "udp-(cfg)-0x%02x (P%c%d)--Config NO delay Interrupt\n", gpioMapTblPtr->PinId,
                  ((gpioMapTblPtr->PinId) >> 4) + 'A', gpioMapTblPtr->PinId & 0x0f);
#endif

      // Configured with neither debounch nor glitch filtering.
      // For no delay, as above, we cannot know the GPIOs state for certain when we
      // receive the interrupt notification. So, we immediately read the state.
      // and hope for the best.
      ret = stm32_gpiosetevent(
      cfgset,               // special gpio for call
      cfg->risingEdge,      // risingEdge,
      cfg->fallingEdge,     // fallingEdge,
      0,                    // event
      upd_gpio_interrupt_no_delay,  // different function to call
      gpioMapTblPtr);       // table entry pointer

      gpioMapTblPtr->CurrentProcessState = updipstate_mon_no_delay;
    }

    return ret;
  }

  // Disable a GPIO interrupt
#if MEADOW_UPD_INCLUDE_DIAGNOSTIC_SYSLOG > 0
syslog(LOG_INFO, "udp-(cfg)-0x%02x (P%c%d)--Disabling GPIO\n", gpioMapTblPtr->PinId,
            ((gpioMapTblPtr->PinId) >> 4) + 'A', gpioMapTblPtr->PinId & 0x0f);
#endif

  // Small chance but it might be active
  upd_remove_gpio_to_timed_list(gpioMapTblPtr);

  // Tell Nuttx to forget about this interrupt
  ret = stm32_gpiosetevent(
      gpioMapTblPtr->PinId,
      0, 0, 0, NULL, NULL);

  if(gpioMapTblPtr->CurrentProcessState != updipstate_mon_no_delay)
    numbGpioBeingTimed--;   // Keep track only of timed gpios

  gpioMapTblPtr->CurrentProcessState = updipstate_uncfg;

  return ret;
}
